In [1]:
import pandas as pd
import numpy as np
import re

In [2]:
df = pd.read_excel('2018-epi-raw-data-time-series.xlsx',sheet_name='CDI')

![img](./images/dct.png)

In [3]:
df.drop(columns=['code','iso'],inplace=True)

In [4]:
df_corrected = pd.melt(df,id_vars =['country'])

In [5]:
df_corrected['variable'] = df_corrected['variable'].apply(lambda x: re.sub(r'\bCDI.','',x))
df_corrected.rename(columns = {'variable':'year','value':'DCT'}, inplace = True)

In [6]:
df_corrected

                        country  year        DCT
0                   Afghanistan  1997        NaN
1                       Albania  1997 -22.880046
2                       Algeria  1997 -22.076274
3                American Samoa  1997        NaN
4                       Andorra  1997        NaN
...                         ...   ...        ...
4243  Wallis and Futuna Islands  2014        NaN
4244             Western Sahara  2014        NaN
4245                      Yemen  2014 -22.127870
4246                     Zambia  2014 -23.306557
4247                   Zimbabwe  2014 -21.487182

[4248 rows x 3 columns]

In [7]:
df_corrected.dtypes

country     object
year        object
DCT        float64
dtype: object

## Replace NaN values using interpolation

In [8]:
df_corrected.isna().sum()

country      0
year         0
DCT        906
dtype: int64

In [9]:
df_corrected = df_corrected.interpolate()

In [10]:
df_corrected.isna().sum()

country    0
year       0
DCT        1
dtype: int64

## Export csv corrected

In [11]:
df_corrected.to_excel('dct_corr.xlsx')

In [33]:
df_corrected.to_csv('gdp_corr.csv')

# SQL

In [30]:
import requests
import getpass
import mysql.connector
import getpass

In [31]:
psw = getpass.getpass()

In [32]:
cnx = mysql.connector.connect(user='root', password=psw, 
                              host='localhost', database='ironhack', use_pure=True)

In [33]:
# see if is connected
if cnx.is_connected():
    print('You are connected to the databse')
else:
    print('Connection is not open')

You are connected to the databse

In [ ]:
# we need to define the object we will use to interact with the database
cursor = cnx.cursor()

In [11]:
df_corrected.dtypes

country        object
year           object
population    float64
dtype: object

In [ ]:
# simple querry to create a table in ironhack_personell database named 'names' with three columns (studens, age, school):

    ### ALSO CHECK IF YOUR QUERIES WERE WELL DONE ###
    
querry = ("CREATE TABLE IF NOT EXISTS "
"population ("
"country VARCHAR(50) PRIMARY KEY ,"
"year VARCHAR(8),"
"pop FLOAT)")

In [ ]:
# this line executes the above querry to create an empty table in MySQL
cursor.execute(querry)

In [ ]:
from sqlalchemy import create_engine

engine = create_engine("mysql+pymysql://{user}:{pw}@localhost/{db}"
                       .format(user="root",
                               pw=psw,
                               db="Ironhack"))


df.to_sql('names', con = engine, if_exists = "append", index=False)

In [35]:
# saving any changes you did on the database
cnx.commit()
# clear the cursor
cursor.close()
# closes the door between python and SQL
cnx.close()